# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "neovim/neovim"

# Binaries
brew "ack"
brew "readline"
brew "autojump"
brew "azure-cli"
brew "aws-cli"
brew "brew-cask-completion"
brew "docker-compose"
brew "doctl"
brew "htop"
brew "java"
brew "kubernetes-cli"
brew "lazygit"
brew "mas"
brew "neovim"
brew "netcat"
brew "openssl@3"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.12"
brew "rustup"
brew "s3cmd"
brew "scala"
brew "sublime-text"
brew "stu"
brew "terraform"
brew "tldr"
brew "virtualenv"
brew "xz"
brew "yazy"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Apps
cask "docker"
cask "iterm2"
cask "lens"
cask "firefox"
cask "intellij-idea-ce"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "pycharm-ce"
cask "signal"
cask "spotify"
cask "slack"
cask "telegram"
cask "vlc"
cask "whatsapp"

