# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Binaries
brew "readline"
brew "sqlite"
brew "xz"
brew "autojump"
brew "azure-cli"
brew "brew-cask-completion"
brew "python@3.10"
brew "docker-compose"
brew "doctl"
brew "htop"
brew "java"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "netcat"
brew "openssl@3"
brew "pipenv"
brew "psqlodbc"
brew "pyenv"
brew "pyenv-virtualenv"
brew "scala"
brew "terraform"
brew "tldr"
brew "virtualenv"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Apps
cask "docker"
cask "go2shell"
cask "iterm2"
cask "lens"
cask "intellij-idea-ce"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "multipass" # Ubuntu VM
cask "pycharm-ce"
cask "signal"
cask "spotify"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

